-- 1) В базе данных Redis подберите коллекцию для подсчета посещений 
-- с определенных IP-адресов.

-- 127.0.0.1:6379> MSET 127.0.0.2 0  127.0.0.3 0 127.0.0.4 0
-- OK
-- 127.0.0.1:6379> MGET 127.0.0.2 127.0.0.3 127.0.0.4
-- 1) "0"
-- 2) "0"
-- 3) "0"
-- 127.0.0.1:6379> INCR 127.0.0.4
-- (integer) 1
-- 127.0.0.1:6379> MGET 127.0.0.2 127.0.0.3 127.0.0.4
-- 1) "0"
-- 2) "0"
-- 3) "1"
-- 127.0.0.1:6379> INCR 127.0.0.2
-- (integer) 1
-- 127.0.0.1:6379> INCR 127.0.0.2
-- (integer) 2
-- 127.0.0.1:6379> MGET 127.0.0.2 127.0.0.3 127.0.0.4
-- 1) "2"
-- 2) "0"
-- 3) "1"

-- 2) При помощи базы данных Redis решите задачу поиска имени 
-- пользователя по электронному адресу и наоборот, 
-- поиск электронного адреса пользователя по его имени.

-- 127.0.0.1:6379> set test1 test1@mail.ru
-- OK
-- 127.0.0.1:6379> set test1@mail.ru test1
-- OK
-- 127.0.0.1:6379> get test1
-- "test1@mail.ru"
-- 127.0.0.1:6379> get test1@mail.ru
-- "test1"

-- 3) Организуйте хранение категорий и товарных позиций 
-- учебной базы данных shop в СУБД MongoDB.

-- use products
-- db.products.insert({"name": "Intel Core i3-8100", "description": "Процессор для настольных ПК", "price": "8000.00", "catalog_id": "Процессоры", "created_at": new Date(), "updated_at": new Date()}) 
-- use catalogs
-- db.catalogs.insertMany([{"name": "Процессоры"}, {"name": "Мат.платы"}, {"name": "Видеокарты"}])